/// =========================================================================================================================
/// Слеповичев И.И. 10.2018
/// <summary>
/// Программа интерпретатор командной строки - CLI для NLDB. Создана для помощи в отладке библиотек NLDB.
/// Поддерживает простой синтаксис команд:
///     <команда> <параметр1>:<значение_параметра1> <параметр2>:<значение_параметра2> ...
/// Основные команда направлены на работу с хранилищем данных: создание хранилища, подключение к хранилищу, запрос данных.
/// </summary>
/// =========================================================================================================================
/// 
namespace NLDB.NLCLI
{
    internal class Program
    {
        private static void Main(string[] args)
        {
            Shell shell = new Shell();
            shell.DialogLoop();
        }
    }
}
